<a href="https://colab.research.google.com/github/semihkoc1/python-app/blob/main/DAwPy_Recap1(DataFrames%2C_Selection_and_Indexing_w_loc%2Ciloc_and_xs)_Student.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

___


<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="Rossum"></p>

___

## Creating a Pandas Series

In [1]:
import numpy as np
import pandas as pd

### Creating a Pandas Series with Basic Format

In [ ]:
ser=pd.Series([5,10,15,20,25])

In [ ]:
ser

0     5
1    10
2    15
3    20
4    25
dtype: int64

### Basic Attributes of Series

In [ ]:
type(ser)

pandas.core.series.Series

In [ ]:
ser.dtype

dtype('int64')

In [ ]:
ser.size

5

In [ ]:
ser.ndim

1

array([ 5, 10, 15, 20, 25], dtype=int64)

0     5
1    10
2    15
dtype: int64

3    20
4    25
dtype: int64

### Creating Pandas Series by Using a ``list``, numpy array or ``dict``ionary

In [ ]:
labels = [i for i in 'python']

my_list = list(np.arange(6))

d = dict(zip(labels,my_list))

arr = np.array([10, 20, 30,40,50,60])

### **Using Lists**

0    p
1    y
2    t
3    h
4    o
5    n
dtype: object

### **Using NumPy Arrays**

p    10
y    20
t    30
h    40
o    50
n    60
dtype: int32

### **Using Dictionary**

p    0
y    1
t    2
h    3
o    4
n    5
dtype: int32

q    NaN
o    4.0
y    1.0
t    2.0
k    NaN
p    0.0
dtype: float64

### Data in a Series

A pandas Series can hold a variety of object types:

In [ ]:
pd.Series({1,2,3,6})

TypeError: 'set' type is unordered

In [ ]:
pd.Series(['pandas', 5, False, np.mean, len])

0                                   pandas
1                                        5
2                                    False
3    <function mean at 0x000001FDC8EC8CA0>
4                  <built-in function len>
dtype: object

***

## Indexing Pandas Series

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look up of information.

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [ ]:
ser1 = pd.Series([1,2,3,4,5],index = ['numpy', 'pandas','sql', 'gss','scipy'])

In [ ]:
ser2 = pd.Series([1,2,5,4,6],index = ['numpy', 'pandas','tableau', 'seaborn','matplotlib'])

In [ ]:
ser1

numpy     1
pandas    2
sql       3
gss       4
scipy     5
dtype: int64

In [ ]:
ser2

numpy         1
pandas        2
tableau       5
seaborn       4
matplotlib    6
dtype: int64

1

5

Operations are then also done based off of index:

In [ ]:
ser1 + ser2

gss           NaN
matplotlib    NaN
numpy         2.0
pandas        4.0
scipy         NaN
seaborn       NaN
sql           NaN
tableau       NaN
dtype: float64

### Indexing Examples

In [ ]:
np.random.seed(101)
a = np.array(np.random.randint(5,12,6))
panser = pd.Series(a)
panser

0     8
1     6
2    11
3    10
4     8
5     6
dtype: int32

0    8
1    6
dtype: int32

### pandas_series[index] | pandas_series[[indices, indices...]]

In [ ]:
panser = pd.Series(data = [25, 32, 35, 33], index = ["terry", "micheal", "orion", "jason"])
panser

terry      25
micheal    32
orion      35
jason      33
dtype: int64

35

In [ ]:
index1 = ['terry', 'micheal', 'jason']

In [ ]:
panser[index1]

terry      25
micheal    32
jason      33
dtype: int64

terry      25
micheal    32
orion      35
dtype: int64

terry      25
micheal    32
orion      35
dtype: int64

### Several Selecting Attributes

In [ ]:
panser.keys()

Index(['terry', 'micheal', 'orion', 'jason'], dtype='object')

In [ ]:
panser.index

Index(['terry', 'micheal', 'orion', 'jason'], dtype='object')

In [ ]:
panser.values

array([25, 32, 35, 33], dtype=int64)

In [ ]:
panser.items()

In [ ]:
list(panser.items())

[('terry', 25), ('micheal', 32), ('orion', 35), ('jason', 33)]

In [ ]:
'jackson' in panser.keys()

False

In [ ]:
25 in panser.values

True

In [ ]:
panser['terry'] = 99

In [ ]:
panser

terry      99
micheal    32
orion      35
jason      33
dtype: int64

In [ ]:
panser[panser > 32]

terry    99
orion    35
jason    33
dtype: int64

***DataFrames***

In [ ]:
data = np.arange(1,21,4)

   column1
0        1
1        5
2        9
3       13
4       17

In [ ]:
data2 = np.arange(1,18,2).reshape(3,3)

In [ ]:
df3=
df3

   var1  var2  var3
0     1     3     5
1     7     9    11
2    13    15    17

In [ ]:
df3.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [ ]:
df3

   new1  new2  new3
0     1     3     5
1     7     9    11
2    13    15    17

for your info:

* 1 dim --> vector 
* 2 dim --> matrix
* 3 dim --> tensor

 - ### Creating a DataFrame using a ``NumPy Arrays``

In [ ]:
m=np.arange(1,50,5).reshape(5,2)
m

array([[ 1,  6],
       [11, 16],
       [21, 26],
       [31, 36],
       [41, 46]])

In [ ]:
df=pd.DataFrame(m, columns=['col1','col2'])
df

   col1  col2
0     1     6
1    11    16
2    21    26
3    31    36
4    41    46

In [ ]:
df.sample(2)

   col1  col2
2    21    26
1    11    16

 - ### Creating a DataFrame using a ``dict``

In [ ]:
np.random.seed(101)
s1 = np.random.randint(10,18, size = 4)
s2 = np.random.randint(19,27, size = 4)
s3 = np.random.randint(28,35, size = 4)

In [ ]:
myDict= {'var1':s1,'var2':s2,'var3':s3}

In [ ]:
df1 = pd.DataFrame(myDict)

In [ ]:
df1

   var1  var2  var3
0    17    26    29
1    13    26    33
2    11    24    28
3    16    22    32

- Simple indexing and slicing the ``DataFrames``

   var1  var2  var3
1    13    26    33
2    11    24    28

In [ ]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
df1

   var1  var2  var3
a    17    26    29
b    13    26    33
c    11    24    28
d    16    22    32

   var1  var2  var3
b    13    26    33
c    11    24    28
d    16    22    32

In [ ]:
# we can check any column name whether it belongs to the DataFrame or not
"var2" in df1

True

In [ ]:
'var5' in df1

False

### Now, let's examine again the ***idexing, selection*** and ***slicing*** methods and several ***attributes*** using a different DataFrame

In [ ]:
from numpy.random import randn
np.random.seed(101)

In [ ]:
# creating a DataFrame by "keyword arguments"
df3=pd.DataFrame(randn(5,4),columns='w x y z'.split(), index='a b c d e'.split())
df3

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [ ]:
df3['y']

a    0.907969
b   -0.848077
c    0.528813
d   -0.933237
e    2.605967
Name: y, dtype: float64

#### DataFrame Columns are just Series

          y
a  0.907969
b -0.848077
c  0.528813
d -0.933237
e  2.605967

In [ ]:
# Pass a list of column names

          w         y
a  2.706850  0.907969
b  0.651118 -0.848077
c -2.018168  0.528813
d  0.188695 -0.933237
e  0.190794  2.605967

In [ ]:
df3

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

**Creating a new column:**

In [ ]:

df3

          w         x         y         z       w+z
a  2.706850  0.628133  0.907969  0.503826  1.363781
b  0.651118 -0.319318 -0.848077  0.605965  0.394555
c -2.018168  0.740122  0.528813 -0.589001  1.188702
d  0.188695 -0.758872 -0.933237  0.955057  0.180215
e  0.190794  1.978757  2.605967  0.683509  0.130410

 - ### Removing Columns

In [ ]:
# Not inplace unless specified!

In [ ]:
df3

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

 - ### Removing rows

In [ ]:
# the default value of axis is 0 (axis = 0)

In [ ]:
df4

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

### Selecting Rows

- ### First, let's take a quick look at [`.loc[]`](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-loc.ipynb) | [`.iloc[]`](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-iloc.ipynb)

#### `.loc[]` → allows us to select data using **labels** (names) of rows (index) & columns

#### `.iloc[]` → allows us to select data using **index numbers** of rows (index) & columns. it's like classical indexing logic

In [ ]:
np.random.seed(101)
m=np.random.randint(1,20, size=(5,4))
df4 = pd.DataFrame(m, columns = ["var1","var2","var3",'var4'])
df4

   var1  var2  var3  var4
0    12    18     7    12
1    16    10    14     9
2     5     9     1    15
3     6    13     9    18
4    16     9     3    13

In [ ]:
df4.loc[4]

var1    16
var2     9
var3     3
var4    13
Name: 4, dtype: int32

In [ ]:
# Slicing produces the same type of the data. Here, DataFrame

   var1  var2  var3  var4
2     5     9     1    15
3     6    13     9    18
4    16     9     3    13

   var1  var2  var3  var4
2     5     9     1    15
3     6    13     9    18

In [ ]:
df4.index='a b c d e'.split()
df4

   var1  var2  var3  var4
a    12    18     7    12
b    16    10    14     9
c     5     9     1    15
d     6    13     9    18
e    16     9     3    13

   var1  var2  var3  var4
b    16    10    14     9
c     5     9     1    15
d     6    13     9    18

   var1  var2  var3  var4
b    16    10    14     9
c     5     9     1    15
d     6    13     9    18
e    16     9     3    13

In [ ]:
df4

   var1  var2  var3  var4
a    12    18     7    12
b    16    10    14     9
c     5     9     1    15
d     6    13     9    18
e    16     9     3    13

b    14
c     1
d     9
e     3
Name: var3, dtype: int32

In [ ]:
# how can we select these data as a DataFrame not a series

   var2
b    10
c     9
d    13

c    1
d    9
e    3
Name: var3, dtype: int32

   var3
c     1
d     9
e     3

In [ ]:
df4.loc['c']

var1     5
var2     9
var3     1
var4    15
Name: c, dtype: int32

In [ ]:
df4.loc[['c']]

   var1  var2  var3  var4
c     5     9     1    15

### Selecting subset of rows and columns

 - ### `.loc[[row labels|names], [column labels|names]]`

 - ### `.iloc[[row index numbers], [column index numbers]]`

In [ ]:
df3

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

-2.018168244037392

In [ ]:
# let's select the same data as a DataFrame

          w
c -2.018168

          w         z
c -2.018168 -0.589001
e  0.190794  0.683509

          w         z
a  2.706850  0.503826
c -2.018168 -0.589001

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d       NaN       NaN       NaN  0.955057
e       NaN  1.978757  2.605967  0.683509

In [ ]:
# It returns based on rows.
df3[df3['y']<0.5]

          w         x         y         z
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057

In [ ]:
df3

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [ ]:
df3[df3['w']<1][['z','y']]

          z         y
b  0.605965 -0.848077
c -0.589001  0.528813
d  0.955057 -0.933237
e  0.683509  2.605967

#### For two conditions you can use **|** → `or`,  **&** →  `and` with parenthesis:

In [ ]:
df3

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

#### Conditional selection using ``.loc[]`` and ``.iloc[]``

In [ ]:
df3

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

          w         z
a  2.706850  0.503826
b  0.651118  0.605965
d  0.188695  0.955057
e  0.190794  0.683509

          x         z
a  0.628133  0.503826
b -0.319318  0.605965
c  0.740122 -0.589001
d -0.758872  0.955057
e  1.978757  0.683509

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [ ]:
df3

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [ ]:
# Reset to default 0,1...n index
df3.reset_index()

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [ ]:
df3.reset_index(drop=True)

          w         x         y         z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [ ]:
newindx='CA NY WY OR CO'.split()
newindx

['CA', 'NY', 'WY', 'OR', 'CO']

In [ ]:
df3['newidx']=newindx

In [ ]:
df3

          w         x         y         z newidx
a  2.706850  0.628133  0.907969  0.503826     CA
b  0.651118 -0.319318 -0.848077  0.605965     NY
c -2.018168  0.740122  0.528813 -0.589001     WY
d  0.188695 -0.758872 -0.933237  0.955057     OR
e  0.190794  1.978757  2.605967  0.683509     CO

In [ ]:
df3

               w         x         y         z
newidx
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [ ]:
# Index Levels
outside = ['M1', 'M1', 'M1', 'M2', 'M2', 'M2','M3', 'M3', 'M3']
inside = [1, 2, 3, 1, 2, 3, 5, 6, 7]
multi_index = list(zip(outside, inside))
multi_index

[('M1', 1),
 ('M1', 2),
 ('M1', 3),
 ('M2', 1),
 ('M2', 2),
 ('M2', 3),
 ('M3', 5),
 ('M3', 6),
 ('M3', 7)]

In [ ]:
hier_index=pd.MultiIndex.from_tuples(multi_index)

In [ ]:
hier_index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           )

In [ ]:
np.random.seed(101)
df5=pd.DataFrame(np.random.randint(0,high=10,size=36).reshape(-1,4), index = hier_index, columns=['A','B','C','D'])
df5

      A  B  C  D
M1 1  1  6  7  9
   2  8  4  8  5
   3  0  5  8  1
M2 1  3  8  3  3
   2  2  8  9  3
   3  7  0  9  7
M3 5  9  8  4  3
   6  3  7  4  8
   7  7  6  9  4

Now let's show how to index this! For index hierarchy we use ``df.loc[]``, if this was on the columns axis, you would just use normal bracket notation ``df[]``. Calling one level of the index returns the sub-dataframe:

   A  B  C  D
5  9  8  4  3
6  3  7  4  8
7  7  6  9  4

A    2
B    8
C    9
D    3
Name: 2, dtype: int32

   A  B  C  D
2  2  8  9  3

In [ ]:
df5.index.names

FrozenList([None, None])

In [ ]:
df5.index.names = ['Group','Num']

In [ ]:
df5

           A  B  C  D
Group Num
M1    1    1  6  7  9
      2    8  4  8  5
      3    0  5  8  1
M2    1    3  8  3  3
      2    2  8  9  3
      3    7  0  9  7
M3    5    9  8  4  3
      6    3  7  4  8
      7    7  6  9  4

### let's take a quick look at the [``.xs()``](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-xs.ipynb)

     A  B  C  D
Num
5    9  8  4  3
6    3  7  4  8
7    7  6  9  4

     A  B  C  D
Num
5    9  8  4  3
6    3  7  4  8
7    7  6  9  4

In [ ]:
df5

           A  B  C  D
Group Num
M1    1    1  6  7  9
      2    8  4  8  5
      3    0  5  8  1
M2    1    3  8  3  3
      2    2  8  9  3
      3    7  0  9  7
M3    5    9  8  4  3
      6    3  7  4  8
      7    7  6  9  4

In [ ]:
df5.xs(('M2',2))

A    2
B    8
C    9
D    3
Name: (M2, 2), dtype: int32

       A  B  C  D
Group
M1     0  5  8  1
M2     7  0  9  7

       A  B  C  D
Group
M1     0  5  8  1
M2     7  0  9  7

     A  B  C  D
Num
1    3  8  3  3
2    2  8  9  3
3    7  0  9  7

Group  Num
M1     1      1
       2      8
       3      0
M2     1      3
       2      2
       3      7
M3     5      9
       6      3
       7      7
Name: A, dtype: int32

     A  B  C  D
Num
5    9  8  4  3
6    3  7  4  8
7    7  6  9  4

In [ ]:
df5.xs(('M1',2),level=[0,1])

           A  B  C  D
Group Num
M1    2    8  4  8  5

In [ ]:
df5.loc[[('M1',2)]]

           A  B  C  D
Group Num
M1    2    8  4  8  5